In [36]:
import pandas as pd

In [37]:
df = pd.DataFrame(
    {
        'a': [1,2,3],
        'b': [5,6,7],
        'c': [8,9,10],
    },
    index=['row1','row2','row3']
)
df

      a  b   c
row1  1  5   8
row2  2  6   9
row3  3  7  10

## Drop rows/columns

In [38]:
# Drop rows: Variant 1
df.drop(['row1','row2'], axis=0)

      a  b   c
row3  3  7  10

In [39]:
# Drop rows: Variant 2
df.drop(index=['row1','row2'])

      a  b   c
row3  3  7  10

In [40]:
# Drop columns: Variant 1
df.drop(['a','b'], axis=1)

       c
row1   8
row2   9
row3  10

In [41]:
# Drop columns: Variant 2
df.drop(columns=['a','b'])

       c
row1   8
row2   9
row3  10

## DataFrames Concatenation

In [42]:
eu_weather_df = pd.DataFrame({
  "town": ["Atina", "Oslo", "London"],
  "temp":[35,21,25],
  "rain": [False, False, True ]
})
eu_weather_df

     town  temp   rain
0   Atina    35  False
1    Oslo    21  False
2  London    25   True

In [43]:
bg_weather_df = pd.DataFrame({
  "town": ["Sofia", "Sandanski", "Pleven"],
  "temp":[25,32,21],
  "rain": [False, False, True ]
})
bg_weather_df

        town  temp   rain
0      Sofia    25  False
1  Sandanski    32  False
2     Pleven    21   True

In [44]:
# concatenate eu_weather_df,bg_weather_df by rows
world_weather_df = pd.concat([eu_weather_df,bg_weather_df], axis=0)
world_weather_df

        town  temp   rain
0      Atina    35  False
1       Oslo    21  False
2     London    25   True
0      Sofia    25  False
1  Sandanski    32  False
2     Pleven    21   True

In [45]:
world_weather_df = pd.concat([eu_weather_df,bg_weather_df], axis=0, ignore_index=True)
world_weather_df

        town  temp   rain
0      Atina    35  False
1       Oslo    21  False
2     London    25   True
3      Sofia    25  False
4  Sandanski    32  False
5     Pleven    21   True

In [46]:
# add unique keys as multi index
world_weather_df = pd.concat([eu_weather_df,bg_weather_df], axis=0, keys=['EU', 'BG'])
world_weather_df

           town  temp   rain
EU 0      Atina    35  False
   1       Oslo    21  False
   2     London    25   True
BG 0      Sofia    25  False
   1  Sandanski    32  False
   2     Pleven    21   True

In [47]:
# index by multiindex
# get 'Atina'
world_weather_df.loc[ ('EU',0), 'town']

'Atina'

In [48]:
# get 'Sofia'
world_weather_df.loc[ ('BG',0), 'town']

'Sofia'

In [49]:
world_weather_df.loc['EU',:]

     town  temp   rain
0   Atina    35  False
1    Oslo    21  False
2  London    25   True

In [50]:
# Concatenate Columns (Horizontal concatenation)

In [51]:
# define wind_df
eu_wind_df=pd.DataFrame([3.4, 2, 6.5], columns=["wind"])
eu_wind_df

   wind
0   3.4
1   2.0
2   6.5

In [52]:
# eu_weather_df = pd.concat([eu_weather_df,eu_wind_df], axis=1, verify_integrity=True)
# eu_weather_df

In [56]:
pd.concat([eu_weather_df,eu_wind_df], axis=1, sort=False)

     town  temp   rain  wind
0   Atina    35  False   3.4
1    Oslo    21  False   2.0
2  London    25   True   6.5

In [59]:
eu_weather_wind_df = pd.concat([eu_weather_df,eu_wind_df], axis=1, sort=True)
eu_weather_wind_df

     town  temp   rain  wind
0   Atina    35  False   3.4
1    Oslo    21  False   2.0
2  London    25   True   6.5

In [61]:
eu_weather_wind_df.sort_values(by='temp', axis=0)

     town  temp   rain  wind
1    Oslo    21  False   2.0
2  London    25   True   6.5
0   Atina    35  False   3.4